//? 1 задание:
// Вам дана переменная num со значением "Привет".Выведите её в консоль и её тип
let num = "Привет";
console.log('\t\t\t\tЗадание 1:\nnum: ', num, "\nтип num = ", typeof num);
//? 2 задание:
// Объявите переменную name и присвойте ей строку со своим именем.Выведите в консоль приветствие используя заданную переменную:
// 'Здравствуйте, Аяна. Как Ваши дела?'
let name = 'Kairat'
console.log('\t\t\t\tЗадание 2:\nЗдраствуйте, ' + name + ". Как Ваши дела?");
//? 3 задание:
// Вам дана переменные а = "Привет", b = 2, c = 3. Сделать конкатенацию в переменной result и вывести в консоль
let a = "Привет";
let b = 2, c = 3;
let result = a + b + c;
console.log('\t\t\t\tЗадание 3:\nresult = ', result);
//? 4 задание:
// Вам дана переменная str со значением "hi".В переменной result1 переменную str умножьте на 5. Выведите в консоль результат и тип данных
let str = "hi"
let result1 = str * 5;
console.log('\t\t\t\tЗадание 4:\nresult1 = ', result1, '\nтип result1 = ', typeof result1);
//? 5 задание:
// Вам даны переменные str1 со значением "4" и num1 со значением 4. Сложить переменные в переменной result2 и вывести в результат в консоль и её тип данных
let str1 = "4", num1 = 4;
let result2 = str1 + num1;
console.log('\t\t\t\tЗадание 5:\nresult2 = ', result2, '\nтип result2 = ', typeof result2);